{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "#": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      "-": 9,
      "/": 10,
      "1": 11,
      "2": 12,
      "3": 13,
      "4": 14,
      "5": 15,
      "6": 16,
      "7": 17,
      "8": 18,
      "=": 19,
      "@": 20,
      "B": 21,
      "C": 22,
      "F": 23,
      "H": 24,
      "I": 25,
      "N": 26,
      "O": 27,
      "P": 28,
      "S": 29,
      "[": 30,
      "\\": 31,
      "]": 32,
      "c": 33,
      "l": 34,
      "n": 35,
      "o": 36,
      "r": 37,
      "s": 38,
      "cc": 39,
      "CC": 40,
      "c1": 41,
      "(=": 42,
      "c2": 43,
      "c1cc": 44,
      "](": 45,
      "@@": 46,
      "NC": 47,
      "c2cc": 48,
      "c3": 49,
      "CCC": 50,
      "c1ccc": 51,
      ")[": 52,
      "cc1": 53,
      "NH": 54,
      "+]": 55,
      "c1cccc": 56,
      "CO": 57,
      "1CC": 58,
      "c2cccc": 59,
      "n1": 60,
      "Cl": 61,
      "nc": 62,
      "C1": 63,
      "c3cc": 64,
      "2CC": 65,
      "OC": 66,
      "CC1": 67,
      "c2ccc": 68,
      "c2ccccc2": 69,
      "c1ccccc1": 70,
      ")(": 71,
      "(-": 72,
      "CN": 73,
      "([": 74,
      "cc2": 75,
      "n2": 76,
      "-]": 77,
      ")(=": 78,
      "1C": 79,
      "nH": 80,
      "C2": 81,
      "CC2": 82,
      "c1n": 83,
      "1CCC": 84,
      "c3cccc": 85,
      "-])": 86,
      "c1c": 87,
      "c2c": 88,
      "Cc1ccc": 89,
      "+](": 90,
      "NH2": 91,
      "CCO": 92,
      ")=": 93,
      "c3ccccc3": 94,
      "2C": 95,
      "CCN": 96,
      "c4": 97,
      "Cc1cc": 98,
      "N1CC": 99,
      "nn": 100,
      "COc1ccc": 101,
      "2CCC": 102,
      "s1": 103,
      "Br": 104,
      "CNC": 105,
      "CS": 106,
      "c3ccc": 107,
      "N2CC": 108,
      "c2n": 109,
      "ccc1": 110,
      "+](=": 111,
      "c1nc": 112,
      "COC": 113,
      "o1": 114,
      "cc3": 115,
      "3CC": 116,
      "c1C": 117,
      "nc2": 118,
      "cccc": 119,
      "NCC": 120,
      "C1CC": 121,
      "nc1": 122,
      "n3": 123,
      "c3c": 124,
      "+][": 125,
      "Nc1ccc": 126,
      "ccc": 127,
      "Cc1n": 128,
      "CC3": 129,
      "]([": 130,
      "NH3": 131,
      "s2": 132,
      "Cc1c": 133,
      "c2nc": 134,
      "Cn1": 135,
      "ccc2": 136,
      "Cc1cccc": 137,
      "sc": 138,
      "C2CC": 139,
      "N1CCC": 140,
      "C3": 141,
      "OCC": 142,
      "CCC1": 143,
      "1CCN": 144,
      "o2": 145,
      "COc1cc": 146,
      "(/": 147,
      "Cc1ccccc1": 148,
      "CCC2": 149,
      "@]": 150,
      "CCOC": 151,
      "@@]": 152,
      "oc": 153,
      "CCNC": 154,
      "O1": 155,
      "N1C": 156,
      "cc1C": 157,
      "CCn1": 158,
      "Nc1cc": 159,
      "+])": 160,
      "N1CCN": 161,
      "N2CCC": 162,
      "c2ccccc21": 163,
      ")/": 164,
      "c4cccc": 165,
      "N2C": 166,
      "Nc2ccc": 167,
      "N3": 168,
      "Nc1cccc": 169,
      "CCCC": 170,
      "SC": 171,
      "COc1cccc": 172,
      "Cc1nc": 173,
      "ncc": 174,
      "n2c": 175,
      "1CN": 176,
      "c2c1": 177,
      "N1": 178,
      "SCC": 179,
      "C2CC2": 180,
      "cc1F": 181,
      "nc3": 182,
      "COc1ccccc1": 183,
      "c4ccccc4": 184,
      "Cc2ccc": 185,
      "cn1": 186,
      "c12": 187,
      "cc1Cl": 188,
      "Cc2ccccc2": 189,
      "CCS": 190,
      "c1nnc": 191,
      "3C": 192,
      "CCCO": 193,
      "1CCCC": 194,
      "C1CC1": 195,
      "c1ccc2c": 196,
      "nn1": 197,
      "1CCCN": 198,
      "N2CCN": 199,
      "c1ncc": 200,
      "CCC3": 201,
      "c2C": 202,
      "NNC": 203,
      "c2ncc": 204,
      "Nc1ccccc1": 205,
      "CCOc1ccc": 206,
      "OCO": 207,
      "CCN1C": 208,
      "@](": 209,
      "cc1OC": 210,
      "no1": 211,
      "OCC2": 212,
      "OCC1": 213,
      "NS": 214,
      "N2": 215,
      "Nc2cc": 216,
      "nn2": 217,
      "O2": 218,
      "c3nc": 219,
      "Cn1c": 220,
      "CN1C": 221,
      "@@](": 222,
      "cc1NC": 223,
      "OCCO": 224,
      "=[": 225,
      "N3CC": 226,
      "c2nnc": 227,
      "2CCCC": 228,
      "CCc1ccc": 229,
      "cs1": 230,
      "CN2CC": 231,
      "NCc1ccc": 232,
      "n2cc": 233,
      "c4ccc": 234,
      "s3": 235,
      "C3CC": 236,
      "c3ccccc32": 237,
      "ncc2": 238,
      "NCCC": 239,
      "c23": 240,
      "Cn1cc": 241,
      "c1nn": 242,
      "c2cccs2": 243,
      "CCn1c": 244,
      "Nc2cccc": 245,
      "c1cccs1": 246,
      "ccc3": 247,
      "Nc2ccccc2": 248,
      "o3": 249,
      "Cc1nn": 250,
      "1CCO": 251,
      "c2ccccc12": 252,
      "Cc1": 253,
      "c2ccc3c": 254,
      "sc1": 255,
      "c3n": 256,
      "c1cc2": 257,
      "n1C": 258,
      "CCCC2": 259,
      "ncc1": 260,
      "1CC1": 261,
      "1CCCO1": 262,
      "n1c": 263,
      "1NC": 264,
      "c2cccnc2": 265,
      "+]([": 266,
      "Cc2c": 267,
      "c2ccco2": 268,
      "N2CCOCC2": 269,
      "1CCCC1": 270,
      "n2C": 271,
      "NN": 272,
      "c1ccco1": 273,
      "3CCC": 274,
      "CCO1": 275,
      "c2nn": 276,
      "c4c": 277,
      "cccc2": 278,
      "Cc3ccccc3": 279,
      "ccc21": 280,
      "C1CCN": 281,
      "N1CCOCC1": 282,
      "Nc1c": 283,
      "cc4": 284,
      "CCCNC": 285,
      "N2CCCC2": 286,
      "Cc2cc": 287,
      "+]=": 288,
      "c1nc2ccccc2": 289,
      "2CCCO2": 290,
      "1CCS": 291,
      "1CO": 292,
      "2CCN": 293,
      "C3CC3": 294,
      "1CCCCC1": 295,
      "cc2C": 296,
      "-])[": 297,
      "Cc2cccc": 298,
      "C4": 299,
      "NC1": 300,
      "Cc1noc": 301,
      "OC2": 302,
      "Oc1ccc": 303,
      "c2ccccc2C": 304,
      "c2ccccc2F": 305,
      "CCCC1": 306,
      "Cc1csc": 307,
      "c1ccccc1F": 308,
      "2CCCC2": 309,
      "CCCN": 310,
      "c2ccccc2c1": 311,
      "1O": 312,
      "NC2": 313,
      "c1ccccc1C": 314,
      "ccc1C": 315,
      "1c1ccc": 316,
      "c1ccccn1": 317,
      "ccc12": 318,
      "ccc1F": 319,
      "cn2": 320,
      "n4": 321,
      "c2nc3ccccc3": 322,
      "cccn2": 323,
      "c1OC": 324,
      "c1cn": 325,
      "nc12": 326,
      "CCOCC3": 327,
      "c1cccc2": 328,
      "c2cc3": 329,
      "no2": 330,
      "c1ccccc1Cl": 331,
      "c1ccncc1": 332,
      "CC4": 333,
      "2CCCN": 334,
      "nc1C": 335,
      "OCO2": 336,
      "sc2": 337,
      "c1ccccc1NC": 338,
      "n1cc": 339,
      "OCCO2": 340,
      "CN2C": 341,
      "c1cccnc1": 342,
      "n2nc": 343,
      "Cc3ccc": 344,
      "2CCCCC2": 345,
      "c2ccccc2Cl": 346,
      "c5": 347,
      "S1": 348,
      "c2ccccn2": 349,
      "c2cnn": 350,
      "C1C": 351,
      "nnc1": 352,
      "CCCC3": 353,
      "c1NC": 354,
      "sc1C": 355,
      "CCn1cc": 356,
      "nc4": 357,
      "Nc3ccc": 358,
      "2CC2": 359,
      "cc12": 360,
      "c2s": 361,
      "c2ccncc2": 362,
      "Nc1ccc2c": 363,
      "Nc1nc": 364,
      "(\\": 365,
      "cc2Cl": 366,
      "COCC": 367,
      "cc21": 368,
      "cc2F": 369,
      "c3ccccc23": 370,
      "nc2c1": 371,
      "on1": 372,
      "c2cn": 373,
      "c1csc": 374,
      "c1cnc": 375,
      "2C1": 376,
      "N1CCCC1": 377,
      "cs2": 378,
      "ccc1Cl": 379,
      "ccc1NC": 380,
      "c1noc": 381,
      "N3CCC": 382,
      "CN1CC": 383,
      "N4": 384,
      "ccc1OC": 385,
      "Cc1ncc": 386,
      "NCc2ccc": 387,
      ")([": 388,
      "c3cccs3": 389,
      "C1CCCC1": 390,
      "c1F": 391,
      "21": 392,
      "sc2c1": 393,
      "OCO3": 394,
      "CCc1nn": 395,
      "n3c": 396,
      "32": 397,
      "C1CCC": 398,
      "C1CCCCC1": 399,
      "CNS": 400,
      "ncc3": 401,
      "CN1CCN": 402,
      "2c": 403,
      "CCCO3": 404,
      "nn1C": 405,
      "@@](=": 406,
      "c2ccccc2C1": 407,
      "2CO": 408,
      "CCCCC": 409,
      "c3ccc4c": 410,
      "c1cnn": 411,
      "Cc1ccc2c": 412,
      "CCO2": 413,
      "c1O": 414,
      "c3c2": 415,
      "N3CCCC3": 416,
      "CCOc1cc": 417,
      "CSC": 418,
      "CCc1cc": 419,
      "cccc3": 420,
      "c2csc": 421,
      "c2noc": 422,
      "Cn2c": 423,
      "cc1S": 424,
      "c3ccccc3C": 425,
      "ccccc4": 426,
      "c3cccnc3": 427,
      "COc1ccc2c": 428,
      "Cc1nnc": 429,
      "c1Cl": 430,
      "N2CCCCC2": 431,
      "ccccc2": 432,
      "Oc2ccc": 433,
      "2CN": 434,
      "c1s": 435,
      "-])=": 436,
      "C2CCN": 437,
      "c3ncc": 438,
      "c3C": 439,
      "c3ccco3": 440,
      "@](=": 441,
      "Nc2nc": 442,
      "ncn2": 443,
      "N3CCOCC3": 444,
      "c3nc4": 445,
      "1S": 446,
      "COc2ccc": 447,
      "nc2ccccc21": 448,
      "n2cccn2": 449,
      "ccc2C": 450,
      "c1cc2c": 451,
      "no": 452,
      "3CCCC": 453,
      "cc2c1": 454,
      "n12": 455,
      "1c1ccccc1": 456,
      "ccc1O": 457,
      "Nc1n": 458,
      "cc1Br": 459,
      "C2C": 460,
      "/[": 461,
      "N3C": 462,
      "c3ccccn3": 463,
      "c1N": 464,
      "CSc1ccc": 465,
      "c1cncc": 466,
      "OCCO3": 467,
      "ccccc12": 468,
      "CCCCC2": 469,
      "2CCS": 470,
      "c3ccccc3c2": 471,
      "C2CCCC2": 472,
      "3CCCO3": 473,
      "c2sc": 474,
      "CCCCC1": 475,
      "nnn1": 476,
      "ccccc3": 477,
      "C2CCCCC2": 478,
      "cccn1": 479,
      "N3CCN": 480,
      "3C2": 481,
      "c3ccccc3F": 482,
      "CN2CCN": 483,
      "2CCO": 484,
      "cccn3": 485,
      "CSCC": 486,
      "c2cnc": 487,
      "CCn1nc": 488,
      "OC3": 489,
      "2O": 490,
      "NCC1": 491,
      "Cc1cnc": 492,
      "c3nnc": 493,
      "N1CCCCC1": 494,
      "CCN2C": 495,
      "CCc1nc": 496,
      "N1CCO": 497,
      "n1CC": 498,
      "nn3": 499,
      "Cn1nc": 500,
      "S2": 501,
      "n3cc": 502,
      "cc1O": 503,
      "c1nccs1": 504,
      "c2cccc3": 505,
      "CCOc1ccccc1": 506,
      "oc1": 507,
      "CCc1ccccc1": 508,
      "ncn1": 509,
      "c4cc": 510,
      "CSc1nnc": 511,
      "CCc1cccc": 512,
      "Cc1cccs1": 513,
      "12": 514,
      "NCc1cc": 515,
      "nc2C": 516,
      "1CCCN1C": 517,
      "3CCCC3": 518,
      "n3C": 519,
      "CCOc1cccc": 520,
      "Nc2c": 521,
      "2CCCN2C": 522,
      "sc3": 523,
      "+])[": 524,
      "CCCN1C": 525,
      "Oc1cccc": 526,
      "1CS": 527,
      "1Cc2ccccc2": 528,
      "c1ccn": 529,
      "NCc1ccccc1": 530,
      "NCCN": 531,
      "c3ccncc3": 532,
      "Nc1nnc": 533,
      "nn2C": 534,
      "CCCS": 535,
      "CC1CC": 536,
      "NC1CC1": 537,
      "c2nc3c": 538,
      "cccc1Cl": 539,
      "c1sc": 540,
      "c1ccsc1": 541,
      "N1CCCC": 542,
      "CCCC4": 543,
      "1c1cccc": 544,
      "CCl": 545,
      "ccn1": 546,
      "OC1": 547,
      "cc2C1": 548,
      "Cc1cc2": 549,
      "nc2n1": 550,
      "c2cc3c": 551,
      "1OCC": 552,
      "on2": 553,
      "Nc2ccc3c": 554,
      "oc2": 555,
      "1CCCCN1C": 556,
      "ccc2F": 557,
      "nc2c": 558,
      "oc2c1": 559,
      "NC2CC2": 560,
      "nnc": 561,
      "CCc1n": 562,
      "NC3": 563,
      "cccc1F": 564,
      "CSc1n": 565,
      "1CCOC1": 566,
      "2NC": 567,
      "nc21": 568,
      "4CC": 569,
      "c2ccsc2": 570,
      "CC1CCN": 571,
      "Nc1ccccc1C": 572,
      "c2ncccn2": 573,
      "c2nccs2": 574,
      "Cc1ccsc1": 575,
      "c3ccccc3C2": 576,
      "c2n1": 577,
      "2CS": 578,
      "Nc3ccccc3": 579,
      "1N": 580,
      "Cn2cc": 581,
      "CCNS": 582,
      "Cn2": 583,
      "CCCO2": 584,
      "Cc1ccco1": 585,
      "cccc1": 586,
      "3CC3": 587,
      "4C": 588,
      "NCCNC": 589,
      "Cc1ccccc1C": 590,
      "c2cncc": 591,
      "3CCCCC3": 592,
      "Nc3cccc": 593,
      "NCc1cccc": 594,
      "OCO4": 595,
      "Cc2nc": 596,
      "nc2cc": 597,
      "Cc1cnn": 598,
      "CCN1CC": 599,
      "CCc1c": 600,
      "c1cc2ccccc2": 601,
      "c32": 602,
      "c1o": 603,
      "c2ccccc2n1": 604,
      "nc23": 605,
      "CCOCC1": 606,
      "Cc1cccc2": 607,
      "N3CCCCC3": 608,
      "CSc2nnc": 609,
      "2c2ccc": 610,
      "Cc3c": 611,
      "1CCOC2": 612,
      "CCCn1c": 613,
      ")=[": 614,
      "N2CCCC": 615,
      "ccc2Cl": 616,
      "Nc2ccccc2C": 617,
      "c4ccccc43": 618,
      "OCCC": 619,
      "c3nc4ccccc4": 620,
      "Oc1ccccc1": 621,
      "c2nc3ccccc3s2": 622,
      "2N": 623,
      "cc32": 624,
      "ccccc23": 625,
      "c2oc": 626,
      "Cc1cccnc1": 627,
      "c1nc2ccccc2s1": 628,
      "NC1CCCCC1": 629,
      "c21": 630,
      "ccc1Br": 631,
      "Sc1nnc": 632,
      "Oc2ccccc2": 633,
      "1OC": 634,
      "c3ccccc3Cl": 635,
      "c3s": 636,
      "SC1": 637,
      "NCc2cc": 638,
      "c2o": 639,
      "CO2": 640,
      "COCCN": 641,
      "Nc3cc": 642,
      "ccccc5": 643,
      "COc1c": 644,
      "C1N": 645,
      "COc1ccccc1C": 646,
      "COc1ccccc1NC": 647,
      "Cc1o": 648,
      "CSc1nc": 649,
      "nc2s": 650,
      "n2cncn2": 651,
      "c2ccccc2O1": 652,
      "n2cnn": 653,
      "N2CCO": 654,
      "ccc32": 655,
      "c34": 656,
      "Cc1ccccc1NC": 657,
      "c3nn": 658,
      "c2c1C": 659,
      "no3": 660,
      "1CCCCC": 661,
      "ccc2c1": 662,
      "3CCN": 663,
      "n1nc": 664,
      "oc1C": 665,
      "Cc1ccccn1": 666,
      "CCc2ccccc2": 667,
      "n3nc": 668,
      "Fc1ccc": 669,
      "O3": 670,
      "c1ccc2ccccc2c1": 671,
      "n2CC": 672,
      "CCCCNC": 673,
      "c2Cl": 674,
      "CCCc1cc": 675,
      "c1CC": 676,
      "Cc1nc2ccccc2": 677,
      "Cc2ccco2": 678,
      "CN1CCC": 679,
      "CN2CCC": 680,
      "2CCOC2": 681,
      "c1cccc2ccccc12": 682,
      "FC": 683,
      "n2ccnc2": 684,
      "CCOCC": 685,
      "CCC4": 686,
      "2C3": 687,
      "c1ccnc": 688,
      "2c2ccccc2": 689,
      "(\\[": 690,
      "Cc3cccc": 691,
      "cc3C": 692,
      "Cc3cc": 693,
      "n2n1": 694,
      "cc1N": 695,
      "cccc2Cl": 696,
      "cn": 697,
      "NCc2ccccc2": 698,
      "1CCc2c": 699,
      "n1cccn1": 700,
      "2CCOCC2": 701,
      "NCC2": 702,
      "cn3": 703,
      "CCCCN": 704,
      "NC1CC": 705,
      "COCCNC": 706,
      "Cc4ccccc4": 707,
      "CCCOc1ccc": 708,
      "COc1cccc2": 709,
      "NC1CCCC1": 710,
      "2CC3CC": 711,
      "cc23": 712,
      "C4CC4": 713,
      "CN2CCOCC2": 714,
      "CCc1noc": 715,
      "c1nc2c": 716,
      "c1CCC": 717,
      "c3cnn": 718,
      "cnn1C": 719,
      "sc2nc": 720,
      "Cc1cc2c": 721,
      "ccc4": 722,
      "c2C1": 723,
      "nc2ccccc12": 724,
      "1COc2ccccc2O1": 725,
      "CCCO1": 726,
      "n3cccn3": 727,
      "Cc1cn": 728,
      "cccc2F": 729,
      "NCc2cccc": 730,
      "Cc1ccc2nc": 731,
      "N2CCCCCC2": 732,
      "CCCn1cc": 733,
      "c1ccccc1OC": 734,
      "n23": 735,
      "SCC1": 736,
      "cc1CNC": 737,
      "Nc1cccc2": 738,
      "CN1CCO": 739,
      "Cc2cccs2": 740,
      "n2cccc2": 741,
      "NCc1ccco1": 742,
      "Nc2nnc": 743,
      "c1ncccc1C": 744,
      "CCCCC4": 745,
      "s4": 746,
      "CCN1CCN": 747,
      "c3ncccn3": 748,
      "cnn1": 749,
      "1C2": 750,
      "c2F": 751,
      "CCCCC3": 752,
      "1CCOCC1": 753,
      "Nc1cccnc1": 754,
      "N1CCC2": 755,
      "n2nn": 756,
      "Cc2csc": 757,
      "c5ccccc5": 758,
      "Cc1ccnc": 759,
      "cc2s1": 760,
      "C1NC": 761,
      "COc1cc2c": 762,
      "c2ccccn12": 763,
      "3CCOCC3": 764,
      "n1nn": 765,
      "C1CCOCC1": 766,
      "ncn3": 767,
      "c3cc4": 768,
      "n2c1": 769,
      "ccc23": 770,
      "CCc1nnc": 771,
      "c2N": 772,
      "CCN1": 773,
      "C1CCC1": 774,
      "CCOCC4": 775,
      "c1ccccc1Br": 776,
      "nn3C": 777,
      "nn12": 778,
      "nc3ccccc32": 779,
      "CC1CCC": 780,
      "Nc1cnn": 781,
      "nc3c": 782,
      "n1C1CC1": 783,
      "c4ccccc34": 784,
      "1Cc1ccccc1": 785,
      "NCCO": 786,
      "CNc1ccc": 787,
      "N1CCc2cc": 788,
      "nc3c2": 789,
      "cccc1NC": 790,
      "1CCCCCC1": 791,
      "c2sccc2": 792,
      "CC1CC1": 793,
      "OCCCO2": 794,
      "C1CN": 795,
      "CCOCC2": 796,
      "c2nnnn2": 797,
      "CNc2ccc": 798,
      "c2ncn": 799,
      "C3CCCCC3": 800,
      "c2cccnc21": 801,
      "CN1": 802,
      "N1CCc2ccccc21": 803,
      "Cc1oc": 804,
      "Oc2cc": 805,
      "1CCCCO1": 806,
      "Cn1ccc": 807,
      "Cc1ccccc1F": 808,
      "c2cc3ccccc3": 809,
      "N1c1ccc": 810,
      "o4": 811,
      "Oc2cccc": 812,
      "cc1OCC": 813,
      "C3CCCC3": 814,
      "c1ccc2": 815,
      "ccc1N": 816,
      "NC1CCN": 817,
      "c2nc3ccc": 818,
      "NCCc1ccc": 819,
      "NC2CCCCC2": 820,
      "+])(": 821,
      "c1ncnc": 822,
      "Cn2nc": 823,
      "c2ccccc2OC": 824,
      "Cc1ccn": 825,
      "N1CCCN": 826,
      "Cc2ccccn2": 827,
      "12CC": 828,
      "CCO3": 829,
      "SCC2": 830,
      "cccc1C": 831,
      "1CCCc2ccccc21": 832,
      "Cc2cccnc2": 833,
      "Nc3nc": 834,
      "c1CNC": 835,
      "c2nccc": 836,
      "N1CCOC": 837,
      "nc2c1c": 838,
      "SC2": 839,
      "c3ccccc3n2": 840,
      "OCCO4": 841,
      "cc3F": 842,
      "Cn1ncc2": 843,
      "Cc1sc": 844,
      "OCc2ccccc2": 845,
      "Nc1nc2c": 846,
      "23": 847,
      "OCCN": 848,
      "c2ccccc2N": 849,
      "N1CCCCCC1": 850,
      "c4nc": 851,
      "cc3C2": 852,
      "c1ccccc1O": 853,
      "oc2cc": 854,
      "2CO1": 855,
      "Sc2ccc": 856,
      "c1ccccc12": 857,
      "c2nc3cc": 858,
      "nc2ccccc2c1": 859,
      "Nc1ncc": 860,
      "2CCCCCC2": 861,
      "ccc1OCC": 862,
      "ccc2OC": 863,
      "ccc2o1": 864,
      "NC2CC": 865,
      "c2ccnc": 866,
      "CO1": 867,
      "1CNC": 868,
      "Nc1ccccc1F": 869,
      "CN2CCO": 870,
      "c2sc3c": 871,
      "NCc3ccc": 872,
      "NC3CC3": 873,
      "Clc1ccc": 874,
      "nc2s1": 875,
      "c2cnccn2": 876,
      "CCc1ccccc1NC": 877,
      "NCCS": 878,
      "NCc1cccnc1": 879,
      "NCCCC": 880,
      "cccnc12": 881,
      "n3ccnc3": 882,
      "oc12": 883,
      "c2ccccc2O": 884,
      "n2cnnn2": 885,
      "2S": 886,
      "c2n1CC": 887,
      "C2CCOCC2": 888,
      "noc2C": 889,
      "cc3Cl": 890,
      "CN1CCOCC1": 891,
      "Cc1ccccc1Cl": 892,
      "c1ccoc1": 893,
      "c4ccco4": 894,
      "cccc21": 895,
      "c2ccoc2": 896,
      "Cn1ccnc1": 897,
      "c1cc2ccccc2o1": 898,
      "Oc1cc": 899,
      "Cc1ccncc1": 900,
      "c3cncc": 901,
      "c2cc1C": 902,
      "c2ncnc": 903,
      "CNc1cc": 904,
      "c2ncnc3": 905,
      "Cn1nn": 906,
      "12C": 907,
      "NC1CCC": 908,
      "c2ccn": 909,
      "c2ccc3ccccc3c2": 910,
      "CCCOC": 911,
      "Cc2ccccc2F": 912,
      "CSc1cccc": 913,
      "Cc1nc2c": 914,
      "Cc1cncc": 915,
      "Cc2ccccc2Cl": 916,
      "CCc3ccccc3": 917,
      "COc2ccccc2": 918,
      "n3n2": 919,
      "sc2n1": 920,
      "CC2CC2": 921,
      "COC2": 922,
      "Nc1nccs1": 923,
      "Sc1n": 924,
      "oc2ccccc12": 925,
      "c3ccsc3": 926,
      "OCc2ccc": 927,
      "CCOc1c": 928,
      "ccc2n1": 929,
      "5c": 930,
      "NCc1nc": 931,
      "c3n2": 932,
      "c2cccc3ccccc23": 933,
      "3c": 934,
      "Nc4ccc": 935,
      "CCc2ccc": 936,
      "COCCN1C": 937,
      "c2cs": 938,
      "cc3c": 939,
      "n3cncn3": 940,
      "OCc1ccccc1": 941,
      "C2CCC": 942,
      "1c1cc": 943,
      "Sc1ccc": 944,
      "nc2nc": 945,
      "NCCc1c": 946,
      "Cc1nc2cc": 947,
      "2c2cccc": 948,
      "3CS": 949,
      "nnc3": 950,
      "c2O": 951,
      "3CCCN": 952,
      "N4CCOCC4": 953,
      "2CCOC3": 954,
      "nc32": 955,
      "Cc2nnc": 956,
      "c2c3c": 957,
      "NCc1ccc2c": 958,
      "COCc1cc": 959,
      "cc2c": 960,
      "(=[": 961,
      "NC2CCCC2": 962,
      "1CCCCN": 963,
      "cc3s2": 964,
      "oc3": 965,
      "NCc1c": 966,
      "NCc2ccco2": 967,
      "n1n": 968,
      "c3cccc4": 969,
      "Cc1cs": 970,
      "c1oc": 971,
      "c2nnn": 972,
      "c1S": 973,
      "COc2cccc": 974,
      "2CCCCC": 975,
      "c4cccs4": 976,
      "c1cnccn1": 977,
      "Cc2ccc3c": 978,
      "nc2sc": 979,
      "Cn1n": 980,
      "ccc2O": 981,
      "c3sc": 982,
      "CCOc1ccccc1NC": 983,
      "c1nnc2ccccn12": 984,
      "c1nc2ccccc2c": 985,
      "CCSC": 986,
      "Nc2cnn": 987,
      "n1cccc1": 988,
      "c1nc2cc": 989,
      "c3ccccc3O2": 990,
      "c1Br": 991,
      "Nc1ccccc1Cl": 992,
      "nc2ccc": 993,
      "2CCC2": 994,
      "CS2": 995,
      "oc2C": 996,
      "n1N": 997,
      "N4CCCC4": 998,
      "c3nccs3": 999,
      "N1CCc2c": 1000,
      "N2CCCN": 1001,
      "cn12": 1002,
      "c2ncccc2C": 1003,
      "1c1cccs1": 1004,
      "cnc12": 1005,
      "OC2CCCC2": 1006,
      "nnc2": 1007,
      "3CCS": 1008,
      "CCCO4": 1009,
      "C2CCC2": 1010,
      "C3C": 1011,
      "c4ccccc4c3": 1012,
      "c1cs": 1013,
      "c1C1CC1": 1014,
      "n1cncn1": 1015,
      "CN3C": 1016,
      "c3noc": 1017,
      "NCCN1C": 1018,
      "CCc1ncc": 1019,
      "c1nc2ccc": 1020,
      "CCOC2": 1021,
      "N1N": 1022,
      "nc3C": 1023
    },
    "merges": [
      "c c",
      "C C",
      "c 1",
      "( =",
      "c 2",
      "c1 cc",
      "] (",
      "@ @",
      "N C",
      "c2 cc",
      "c 3",
      "CC C",
      "c1cc c",
      ") [",
      "cc 1",
      "N H",
      "+ ]",
      "c1cc cc",
      "C O",
      "1 CC",
      "c2cc cc",
      "n 1",
      "C l",
      "n c",
      "C 1",
      "c3 cc",
      "2 CC",
      "O C",
      "CC 1",
      "c2cc c",
      "c2cccc c2",
      "c1cccc c1",
      ") (",
      "( -",
      "C N",
      "( [",
      "cc 2",
      "n 2",
      "- ]",
      ") (=",
      "1 C",
      "n H",
      "C 2",
      "CC 2",
      "c1 n",
      "1 CCC",
      "c3cc cc",
      "-] )",
      "c1 c",
      "c2 c",
      "C c1ccc",
      "+ ](",
      "NH 2",
      "CC O",
      ") =",
      "c3cccc c3",
      "2 C",
      "CC N",
      "c 4",
      "C c1cc",
      "N 1CC",
      "n n",
      "CO c1ccc",
      "2 CCC",
      "s 1",
      "B r",
      "C NC",
      "C S",
      "c3cc c",
      "N 2CC",
      "c2 n",
      "cc c1",
      "+] (=",
      "c1 nc",
      "CO C",
      "o 1",
      "cc 3",
      "3 CC",
      "c1 C",
      "n c2",
      "cc cc",
      "N CC",
      "C 1CC",
      "n c1",
      "n 3",
      "c3 c",
      "+] [",
      "N c1ccc",
      "cc c",
      "C c1n",
      "CC 3",
      "]( [",
      "NH 3",
      "s 2",
      "C c1c",
      "c2 nc",
      "C n1",
      "cc c2",
      "C c1cccc",
      "s c",
      "C 2CC",
      "N 1CCC",
      "C 3",
      "O CC",
      "CCC 1",
      "1CC N",
      "o 2",
      "CO c1cc",
      "( /",
      "C c1ccccc1",
      "CCC 2",
      "@ ]",
      "CC OC",
      "@@ ]",
      "o c",
      "CC NC",
      "O 1",
      "N 1C",
      "cc1 C",
      "CC n1",
      "N c1cc",
      "+] )",
      "N1CC N",
      "N 2CCC",
      "c2ccccc2 1",
      ") /",
      "c4 cccc",
      "N 2C",
      "N c2ccc",
      "N 3",
      "N c1cccc",
      "CC CC",
      "S C",
      "CO c1cccc",
      "C c1nc",
      "n cc",
      "n2 c",
      "1 CN",
      "c2 c1",
      "N 1",
      "S CC",
      "C2CC 2",
      "cc1 F",
      "n c3",
      "CO c1ccccc1",
      "c4cccc c4",
      "C c2ccc",
      "c n1",
      "c1 2",
      "cc1 Cl",
      "C c2ccccc2",
      "CC S",
      "c1n nc",
      "3 C",
      "CCC O",
      "1CC CC",
      "C1CC 1",
      "c1cc c2c",
      "n n1",
      "1CCC N",
      "N2CC N",
      "c1n cc",
      "CCC 3",
      "c2 C",
      "N NC",
      "c2n cc",
      "N c1ccccc1",
      "CCO c1ccc",
      "O CO",
      "CCN 1C",
      "@ ](",
      "cc1 OC",
      "n o1",
      "O CC2",
      "O CC1",
      "N S",
      "N 2",
      "N c2cc",
      "n n2",
      "O 2",
      "c3 nc",
      "Cn1 c",
      "CN 1C",
      "@@ ](",
      "cc1 NC",
      "O CCO",
      "= [",
      "N 3CC",
      "c2n nc",
      "2CC CC",
      "CC c1ccc",
      "c s1",
      "CN 2CC",
      "NC c1ccc",
      "n2 cc",
      "c4 ccc",
      "s 3",
      "C 3CC",
      "c3ccccc3 2",
      "n cc2",
      "N CCC",
      "c2 3",
      "Cn1 cc",
      "c1n n",
      "c2ccc s2",
      "CCn1 c",
      "N c2cccc",
      "c1ccc s1",
      "cc c3",
      "N c2ccccc2",
      "o 3",
      "Cc1n n",
      "1CC O",
      "c2cccc c12",
      "C c1",
      "c2cc c3c",
      "s c1",
      "c3 n",
      "c1cc 2",
      "n1 C",
      "CC CC2",
      "n cc1",
      "1CC 1",
      "1CCC O1",
      "n1 c",
      "1 NC",
      "c2ccc nc2",
      "+]( [",
      "C c2c",
      "c2ccc o2",
      "N2CC OCC2",
      "1CC CC1",
      "n2 C",
      "N N",
      "c1ccc o1",
      "3 CCC",
      "CCO 1",
      "c2 nn",
      "c4 c",
      "cc cc2",
      "C c3ccccc3",
      "ccc2 1",
      "C1CC N",
      "N1CC OCC1",
      "N c1c",
      "cc 4",
      "CCC NC",
      "N2CC CC2",
      "C c2cc",
      "+] =",
      "c1n c2ccccc2",
      "2CCC O2",
      "1CC S",
      "1 CO",
      "2CC N",
      "C3CC 3",
      "1CC CCC1",
      "cc2 C",
      "-] )[",
      "C c2cccc",
      "C 4",
      "NC 1",
      "Cc1n oc",
      "OC 2",
      "O c1ccc",
      "c2ccccc2 C",
      "c2ccccc2 F",
      "CC CC1",
      "Cc1c sc",
      "c1ccccc1 F",
      "2CC CC2",
      "CCC N",
      "c2ccccc2 c1",
      "1 O",
      "NC 2",
      "c1ccccc1 C",
      "ccc1 C",
      "1 c1ccc",
      "c1cccc n1",
      "ccc1 2",
      "ccc1 F",
      "c n2",
      "n 4",
      "c2n c3ccccc3",
      "ccc n2",
      "c1 OC",
      "c1c n",
      "nc1 2",
      "CCO CC3",
      "c1cccc 2",
      "c2cc 3",
      "n o2",
      "c1ccccc1 Cl",
      "c1cc ncc1",
      "CC 4",
      "2CCC N",
      "n c1C",
      "OCO 2",
      "s c2",
      "c1ccccc1 NC",
      "n1 cc",
      "OCCO 2",
      "CN 2C",
      "c1ccc nc1",
      "n2 nc",
      "C c3ccc",
      "2CC CCC2",
      "c2ccccc2 Cl",
      "c 5",
      "S 1",
      "c2cccc n2",
      "c2c nn",
      "C1 C",
      "nn c1",
      "CC CC3",
      "c1 NC",
      "s c1C",
      "CCn1 cc",
      "nc 4",
      "N c3ccc",
      "2CC 2",
      "cc1 2",
      "c2 s",
      "c2cc ncc2",
      "Nc1cc c2c",
      "N c1nc",
      "( \\",
      "cc2 Cl",
      "CO CC",
      "cc2 1",
      "cc2 F",
      "c3cccc c23",
      "nc2 c1",
      "o n1",
      "c2c n",
      "c1c sc",
      "c1c nc",
      "2 C1",
      "N1CC CC1",
      "c s2",
      "ccc1 Cl",
      "ccc1 NC",
      "c1n oc",
      "N3 CCC",
      "CN 1CC",
      "N 4",
      "ccc1 OC",
      "Cc1n cc",
      "NC c2ccc",
      ")( [",
      "c3ccc s3",
      "C1CC CC1",
      "c1 F",
      "2 1",
      "s c2c1",
      "OCO 3",
      "CC c1nn",
      "n3 c",
      "3 2",
      "C1 CCC",
      "C1CC CCC1",
      "CN S",
      "n cc3",
      "CN 1CCN",
      "2 c",
      "CCCO 3",
      "nn1 C",
      "@@] (=",
      "c2ccccc2 C1",
      "2 CO",
      "CC CCC",
      "c3cc c4c",
      "c1c nn",
      "Cc1cc c2c",
      "CCO 2",
      "c1 O",
      "c3 c2",
      "N3CC CC3",
      "CCO c1cc",
      "CS C",
      "CC c1cc",
      "cc cc3",
      "c2c sc",
      "c2n oc",
      "C n2c",
      "cc1 S",
      "c3ccccc3 C",
      "cccc c4",
      "c3ccc nc3",
      "COc1cc c2c",
      "Cc1n nc",
      "c1 Cl",
      "N2CC CCC2",
      "cccc c2",
      "O c2ccc",
      "2 CN",
      "c1 s",
      "-]) =",
      "C2CC N",
      "c3 ncc",
      "c3 C",
      "c3ccc o3",
      "@] (=",
      "N c2nc",
      "nc n2",
      "N3 CCOCC3",
      "c3nc 4",
      "1 S",
      "CO c2ccc",
      "n c2ccccc21",
      "n2 cccn2",
      "ccc2 C",
      "c1cc2 c",
      "n o",
      "3CC CC",
      "cc2 c1",
      "n1 2",
      "1 c1ccccc1",
      "ccc1 O",
      "N c1n",
      "cc1 Br",
      "C2 C",
      "/ [",
      "N3 C",
      "c3cccc n3",
      "c1 N",
      "CS c1ccc",
      "c1c ncc",
      "OCCO 3",
      "cc ccc12",
      "CC CCC2",
      "2CC S",
      "c3ccccc3 c2",
      "C2CC CC2",
      "3 CCCO3",
      "c2 sc",
      "CC CCC1",
      "nn n1",
      "cccc c3",
      "C2CC CCC2",
      "ccc n1",
      "N3 CCN",
      "3 C2",
      "c3ccccc3 F",
      "CN2CC N",
      "2CC O",
      "ccc n3",
      "CS CC",
      "c2c nc",
      "CCn1 nc",
      "OC 3",
      "2 O",
      "N CC1",
      "Cc1c nc",
      "c3n nc",
      "N1CC CCC1",
      "CCN 2C",
      "CC c1nc",
      "N1CC O",
      "n 1CC",
      "nn 3",
      "Cn1 nc",
      "S 2",
      "n3 cc",
      "cc1 O",
      "c1ncc s1",
      "c2cccc 3",
      "CCO c1ccccc1",
      "o c1",
      "CC c1ccccc1",
      "nc n1",
      "c4 cc",
      "CS c1nnc",
      "CC c1cccc",
      "Cc1ccc s1",
      "1 2",
      "NC c1cc",
      "nc2 C",
      "1CCC N1C",
      "3CC CC3",
      "n3 C",
      "CCO c1cccc",
      "N c2c",
      "2CCC N2C",
      "s c3",
      "+] )[",
      "CCC N1C",
      "O c1cccc",
      "1C S",
      "1C c2ccccc2",
      "c1cc n",
      "NC c1ccccc1",
      "N CCN",
      "c3cc ncc3",
      "N c1nnc",
      "nn2 C",
      "CCC S",
      "CC 1CC",
      "NC 1CC1",
      "c2n c3c",
      "cc cc1Cl",
      "c1 sc",
      "c1cc sc1",
      "N1CC CC",
      "CCCC 4",
      "1 c1cccc",
      "CC l",
      "cc n1",
      "O C1",
      "cc2 C1",
      "Cc1cc 2",
      "nc2 n1",
      "c2cc3 c",
      "1 OCC",
      "o n2",
      "Nc2cc c3c",
      "o c2",
      "1CC CCN1C",
      "ccc2 F",
      "n c2c",
      "o c2c1",
      "NC 2CC2",
      "n nc",
      "CC c1n",
      "NC 3",
      "cc cc1F",
      "CS c1n",
      "1CCO C1",
      "2 NC",
      "nc2 1",
      "4 CC",
      "c2cc sc2",
      "CC 1CCN",
      "Nc1ccccc1 C",
      "c2n cccn2",
      "c2ncc s2",
      "Cc1cc sc1",
      "c3ccccc3 C2",
      "c2 n1",
      "2C S",
      "N c3ccccc3",
      "1 N",
      "C n2cc",
      "CCN S",
      "C n2",
      "CCCO 2",
      "Cc1ccc o1",
      "cc cc1",
      "3CC 3",
      "4 C",
      "NCC NC",
      "Cc1ccccc1 C",
      "c2c ncc",
      "3CC CCC3",
      "N c3cccc",
      "NC c1cccc",
      "OCO 4",
      "C c2nc",
      "n c2cc",
      "Cc1c nn",
      "CCN 1CC",
      "CC c1c",
      "c1cc2 ccccc2",
      "c3 2",
      "c1 o",
      "c2ccccc2 n1",
      "nc2 3",
      "CCO CC1",
      "Cc1cccc 2",
      "N3CC CCC3",
      "CS c2nnc",
      "2 c2ccc",
      "C c3c",
      "1CC OC2",
      "CCC n1c",
      ")= [",
      "N2CC CC",
      "ccc2 Cl",
      "Nc2ccccc2 C",
      "c4ccccc4 3",
      "O CCC",
      "c3nc4 ccccc4",
      "O c1ccccc1",
      "c2nc3ccccc3 s2",
      "2 N",
      "cc3 2",
      "cccc c23",
      "c2 oc",
      "Cc1ccc nc1",
      "c1nc2ccccc2 s1",
      "NC 1CCCCC1",
      "c2 1",
      "ccc1 Br",
      "S c1nnc",
      "O c2ccccc2",
      "1 OC",
      "c3ccccc3 Cl",
      "c3 s",
      "S C1",
      "NC c2cc",
      "c2 o",
      "CO 2",
      "CO CCN",
      "N c3cc",
      "cccc c5",
      "CO c1c",
      "C1 N",
      "COc1ccccc1 C",
      "COc1ccccc1 NC",
      "Cc1 o",
      "CS c1nc",
      "nc2 s",
      "n2c ncn2",
      "c2ccccc2 O1",
      "n2c nn",
      "N2CC O",
      "ccc3 2",
      "c3 4",
      "Cc1ccccc1 NC",
      "c3 nn",
      "c2 c1C",
      "n o3",
      "1CC CCC",
      "ccc2 c1",
      "3 CCN",
      "n1 nc",
      "o c1C",
      "Cc1cccc n1",
      "CC c2ccccc2",
      "n3 nc",
      "F c1ccc",
      "O 3",
      "c1cc c2ccccc2c1",
      "n 2CC",
      "CC CCNC",
      "c2 Cl",
      "CCC c1cc",
      "c1 CC",
      "Cc1n c2ccccc2",
      "Cc2ccc o2",
      "CN 1CCC",
      "CN 2CCC",
      "2CC OC2",
      "c1cccc2 ccccc12",
      "F C",
      "n2cc nc2",
      "CCO CC",
      "CCC 4",
      "2C 3",
      "c1cc nc",
      "2 c2ccccc2",
      "(\\ [",
      "C c3cccc",
      "cc3 C",
      "C c3cc",
      "n2 n1",
      "cc1 N",
      "cccc2 Cl",
      "c n",
      "NC c2ccccc2",
      "1CC c2c",
      "n1 cccn1",
      "2CC OCC2",
      "N CC2",
      "c n3",
      "CC CCN",
      "NC 1CC",
      "CO CCNC",
      "C c4ccccc4",
      "CCCO c1ccc",
      "COc1cccc 2",
      "NC 1CCCC1",
      "2CC 3CC",
      "cc2 3",
      "C4 CC4",
      "CN2CC OCC2",
      "CC c1noc",
      "c1n c2c",
      "c1 CCC",
      "c3c nn",
      "c nn1C",
      "s c2nc",
      "Cc1cc 2c",
      "cc c4",
      "c2 C1",
      "n c2ccccc12",
      "1CO c2ccccc2O1",
      "CCC O1",
      "n3 cccn3",
      "Cc1c n",
      "cccc2 F",
      "NC c2cccc",
      "Cc1cc c2nc",
      "N2CC CCCC2",
      "CCC n1cc",
      "c1ccccc1 OC",
      "n2 3",
      "S CC1",
      "cc1 CNC",
      "Nc1cccc 2",
      "CN 1CCO",
      "Cc2ccc s2",
      "n2cc cc2",
      "NCc1ccc o1",
      "N c2nnc",
      "c1ncc cc1C",
      "CCCCC 4",
      "s 4",
      "CCN 1CCN",
      "c3n cccn3",
      "c nn1",
      "1C 2",
      "c2 F",
      "CC CCC3",
      "1CC OCC1",
      "Nc1ccc nc1",
      "N1CCC 2",
      "n2 nn",
      "Cc2c sc",
      "c5 ccccc5",
      "Cc1cc nc",
      "cc2 s1",
      "C1 NC",
      "COc1cc 2c",
      "c2cccc n12",
      "3 CCOCC3",
      "n1 nn",
      "C1CC OCC1",
      "nc n3",
      "c3cc 4",
      "n2 c1",
      "ccc2 3",
      "CC c1nnc",
      "c2 N",
      "CCN 1",
      "C1 CCC1",
      "CCO CC4",
      "c1ccccc1 Br",
      "nn 3C",
      "nn1 2",
      "n c3ccccc32",
      "CC1 CCC",
      "Nc1c nn",
      "n c3c",
      "n1 C1CC1",
      "c4cccc c34",
      "1C c1ccccc1",
      "N CCO",
      "CN c1ccc",
      "N1CC c2cc",
      "nc3 c2",
      "cc cc1NC",
      "1CCCC CC1",
      "c2s ccc2",
      "CC 1CC1",
      "O CCCO2",
      "C1 CN",
      "CCO CC2",
      "c2nn nn2",
      "CN c2ccc",
      "c2nc n",
      "C3CC CCC3",
      "c2cccnc2 1",
      "CN 1",
      "N1CC c2ccccc21",
      "Cc1 oc",
      "O c2cc",
      "1CC CCO1",
      "Cn1 ccc",
      "Cc1ccccc1 F",
      "c2cc3 ccccc3",
      "N1 c1ccc",
      "o 4",
      "O c2cccc",
      "cc1 OCC",
      "C3CC CC3",
      "c1cc c2",
      "ccc1 N",
      "NC 1CCN",
      "c2n c3ccc",
      "NCC c1ccc",
      "NC 2CCCCC2",
      "+] )(",
      "c1nc nc",
      "C n2nc",
      "c2ccccc2 OC",
      "Cc1cc n",
      "N1CCC N",
      "Cc2cccc n2",
      "1 2CC",
      "CCO 3",
      "S CC2",
      "cc cc1C",
      "1CCC c2ccccc21",
      "Cc2ccc nc2",
      "N c3nc",
      "c1 CNC",
      "c2n ccc",
      "N1CC OC",
      "nc2 c1c",
      "S C2",
      "c3ccccc3 n2",
      "OCCO 4",
      "cc3 F",
      "Cn1 ncc2",
      "Cc1 sc",
      "OC c2ccccc2",
      "Nc1n c2c",
      "2 3",
      "O CCN",
      "c2ccccc2 N",
      "N1CC CCCC1",
      "c4 nc",
      "cc3 C2",
      "c1ccccc1 O",
      "o c2cc",
      "2CO 1",
      "S c2ccc",
      "c1ccccc1 2",
      "c2n c3cc",
      "n c2ccccc2c1",
      "N c1ncc",
      "2CCCC CC2",
      "ccc1 OCC",
      "ccc2 OC",
      "ccc2 o1",
      "NC 2CC",
      "c2cc nc",
      "CO 1",
      "1C NC",
      "Nc1ccccc1 F",
      "CN2CC O",
      "c2s c3c",
      "NC c3ccc",
      "NC 3CC3",
      "Cl c1ccc",
      "nc2 s1",
      "c2cncc n2",
      "CC c1ccccc1NC",
      "NCC S",
      "NCc1ccc nc1",
      "NCC CC",
      "ccc nc12",
      "n3cc nc3",
      "o c12",
      "c2ccccc2 O",
      "n2cnn n2",
      "2 S",
      "c2n 1CC",
      "C2CC OCC2",
      "no c2C",
      "cc3 Cl",
      "CN1CC OCC1",
      "Cc1ccccc1 Cl",
      "c1cc oc1",
      "c4ccc o4",
      "cccc2 1",
      "c2cc oc2",
      "Cn1cc nc1",
      "c1cc2ccccc2 o1",
      "O c1cc",
      "Cc1cc ncc1",
      "c3c ncc",
      "c2cc 1C",
      "c2nc nc",
      "CN c1cc",
      "c2nc nc3",
      "Cn1 nn",
      "1 2C",
      "NC 1CCC",
      "c2cc n",
      "c2cc c3ccccc3c2",
      "CCC OC",
      "Cc2ccccc2 F",
      "CS c1cccc",
      "Cc1n c2c",
      "Cc1c ncc",
      "Cc2ccccc2 Cl",
      "CC c3ccccc3",
      "CO c2ccccc2",
      "n3 n2",
      "sc2 n1",
      "CC 2CC2",
      "CO C2",
      "N c1nccs1",
      "S c1n",
      "o c2ccccc12",
      "c3cc sc3",
      "OC c2ccc",
      "CCO c1c",
      "ccc2 n1",
      "5 c",
      "NC c1nc",
      "c3 n2",
      "c2cccc3 ccccc23",
      "3 c",
      "N c4ccc",
      "CC c2ccc",
      "CO CCN1C",
      "c2c s",
      "cc3 c",
      "n3c ncn3",
      "OC c1ccccc1",
      "C2 CCC",
      "1 c1cc",
      "S c1ccc",
      "nc2 nc",
      "NCC c1c",
      "Cc1n c2cc",
      "2 c2cccc",
      "3 CS",
      "nn c3",
      "c2 O",
      "3CCC N",
      "N4 CCOCC4",
      "2CC OC3",
      "nc3 2",
      "C c2nnc",
      "c2 c3c",
      "NC c1ccc2c",
      "CO Cc1cc",
      "cc2 c",
      "(= [",
      "NC 2CCCC2",
      "1CC CCN",
      "cc3 s2",
      "o c3",
      "NC c1c",
      "NC c2ccco2",
      "n1 n",
      "c3cccc 4",
      "Cc1c s",
      "c1 oc",
      "c2nn n",
      "c1 S",
      "CO c2cccc",
      "2CC CCC",
      "c4ccc s4",
      "c1cncc n1",
      "C c2ccc3c",
      "nc2 sc",
      "Cn1 n",
      "ccc2 O",
      "c3 sc",
      "CCO c1ccccc1NC",
      "c1nn c2ccccn12",
      "c1nc2ccccc2 c",
      "CC SC",
      "N c2cnn",
      "n1cc cc1",
      "c1n c2cc",
      "c3ccccc3 O2",
      "c1 Br",
      "Nc1ccccc1 Cl",
      "n c2ccc",
      "2CCC 2",
      "CS 2",
      "o c2C",
      "n1 N",
      "N4 CCCC4",
      "c3ncc s3",
      "N1CC c2c",
      "N2CCC N",
      "cn1 2",
      "c2ncc cc2C",
      "1 c1cccs1",
      "c nc12",
      "OC 2CCCC2",
      "nn c2",
      "3CC S",
      "CCCO 4",
      "C2 CCC2",
      "C3 C",
      "c4ccccc4 c3",
      "c1c s",
      "c1C 1CC1",
      "n1c ncn1",
      "CN 3C",
      "c3n oc",
      "N CCN1C",
      "CC c1ncc",
      "c1n c2ccc",
      "CCOC 2",
      "N1 N",
      "nc3 C"
    ]
  }
}